MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_pid.c
/**
 *******************************************************************************
 * @file hc32_ll_pid.c
 * @brief This file provides firmware functions to manage the high precision
 *        Reference Voltage(PID).
  @verbatim
   Change Logs:
   Date             Author          Notes
   2026-04-16       CDT             First version
  @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2026, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_pid.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_PID PID
 * @brief PID Driver Library
 * @{
 */

#if (LL_PID_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup PID_Local_Macros PID Local Macros
 * @{
 */
#define PID_FLOAT_READ_REG32(reg)         (*(__IO float32_t *)((uint32_t)(&reg)))
#define PID_FLOAT_WRITE_REG32(reg, value) WRITE_REG32((reg), (*(__IO uint32_t *)((uint32_t)&(value))));

#define PID_COEF_REG(reg_base, ch) ((__IO uint32_t *)((uint32_t)(&(reg_base)) + ((ch) * 0xCUL)))

/**
 * @defgroup PID_Check_Parameters_Validity PID Check Parameters Validity
 * @{
 */
/* Parameter valid check for PID calculate mode */
#define IS_PID_UNIT(x) (((x) == CM_PID1) || ((x) == CM_PID2))

/* Parameter valid check for PID calculate mode */
#define IS_PID_CAL_MD(x) (((x) == PID_CAL_MD_SW) || ((x) == PID_CAL_MD_HW_AVAL) || ((x) == PID_CAL_MD_HW_AVAL_REF))

/* Parameter valid check for PID integrate mode */
#define IS_PID_INTEG_MD(x) (((x) == PID_INTEG_MD_EK) || ((x) == PID_INTEG_MD_EK_EK_1))

/* Parameter valid check for PID differential mode */
#define IS_PID_DIFF_MD(x) (((x) == PID_DIFF_MD_WITHOUT_FEEDBACK) || ((x) == PID_DIFF_MD_WITH_FEEDBACK))

/* Parameter valid check for PID coefficient mode */
#define IS_PID_COEF_MD(x) \
    (((x) == PID_COEF_MD_1) || ((x) == PID_COEF_MD_2) || ((x) == PID_COEF_MD_3) || ((x) == PID_COEF_MD_4))

#define IS_PID_U1_P2_DATA_SEL(x)                                                                  \
    (((x) == PID_U1_P2_DATA_IIR1) || ((x) == PID_U1_P2_DATA_IIR2) || ((x) == PID_U1_P2_DATA_IIR3) \
  || ((x) == PID_U1_P2_DATA_IIR4) || ((x) == PID_U1_P2_DATA_IIR5) || ((x) == PID_U1_P2_DATA_IIR6))

#define IS_PID_U3_P2_DATA_SEL(x)                                                                                 \
    (((x) == PID_U3_P2_DATA_SOGI_SIN) || ((x) == PID_U3_P2_DATA_SOGI_COS) || ((x) == PID_U3_P2_DATA_CORDIC_RES1) \
  || ((x) == PID_U3_P2_DATA_CORDIC_RES2))

#define IS_PID_U3_P2_WAIT_STATE(x) (((x) == PID_U3_P2_WAIT_OFF) || ((x) == PID_U3_P2_WAIT_ON))

#define IS_PID_U3_P4_CAL_TYPE(x) (((x) == PID_U3_P4_CAL_ADD) || ((x) == PID_U3_P4_CAL_SUB))

#define IS_PID_U3_P4_WAIT_STATE(x) (((x) == PID_U3_P4_WAIT_OFF) || ((x) == PID_U3_P4_WAIT_ON))

/* Parameter valid check for PID init expected value selection while software start */
#define IS_PID_SW_INIT_EV_SEL(x) (((x) == PID_SW_INIT_EV_REF) || ((x) == PID_SW_INIT_EV_AVAL))

/* Parameter valid check for PID coefficient number */
#define IS_PID_COEF_NUM(x) ((x) <= PID_COEF_NUM_3)

/* Parameter valid check for PID actual value selection */
#define IS_PID_AVAL_SEL(x)                                                                               \
    (((x) == PID_AVAL_REG) || ((x) == PID_AVAL_IIR1) || ((x) == PID_AVAL_IIR2) || ((x) == PID_AVAL_IIR3) \
  || ((x) == PID_AVAL_IIR4) || ((x) == PID_AVAL_IIR5) || ((x) == PID_AVAL_IIR6))

/* Parameter valid check for PID expected value selection */
#define IS_PID_EV_SEL(x) (((x) == PID_EV_REG) || ((x) == PID_EV_P1_U3) || ((x) == PID_EV_P2_U3))

/* Parameter valid check for PID E(k) minimum selection */
#define IS_PID_EK_MIN_SEL(x) (((x) == PID_EK_MIN_EMIN) || ((x) == PID_EK_MIN_0))

/* Parameter valid check for PID KF minimum selection */
#define IS_PID_KF_MIN_SEL(x) (((x) == PID_KF_MIN_KFMIN) || ((x) == PID_KF_MIN_0))

/* Parameter valid check for PID Ki minimum selection */
#define IS_PID_KI_MIN_SEL(x) (((x) == PID_KI_MIN_IMIN) || ((x) == PID_KI_MIN_0))

/* Parameter valid check for PID Kd minimum selection */
#define IS_PID_KD_MIN_SEL(x) (((x) == PID_KD_MIN_DMIN) || ((x) == PID_KD_MIN_0))

/* Parameter valid check for PID U minimum selection */
#define IS_PID_U_MIN_SEL(x) (((x) == PID_U_MIN_UMIN) || ((x) == PID_U_MIN_0))

/* Parameter valid check for PID U1 minimum selection */
#define IS_PID_U1_MIN_SEL(x) (((x) == PID_U1_MIN_U1MIN) || ((x) == PID_U1_MIN_0))

/* Parameter valid check for PID U3 minimum selection */
#define IS_PID_U3_MIN_SEL(x) (((x) == PID_U3_MIN_U3MIN) || ((x) == PID_U3_MIN_0))

/* Parameter valid check for PID U5 minimum selection */
#define IS_PID_U5_MIN_SEL(x) (((x) == PID_U5_MIN_U5MIN) || ((x) == PID_U5_MIN_0))

/* Parameter valid check for PID U5 minimum selection */
#define IS_PID_FLAG(x) \
    (((x) == PID_FLAG_DATA_RDY) || ((x) == PID_FLAG_CAL_OVER) || ((x) == PID_FLAG_CAL_INF) || ((x) == PID_FLAG_CAL_NAN))

/* Parameter valid check for PID competition output selection */
#define IS_PID_COMP_OUTPUT_SEL(x)                                                                   \
    (((x) == PID_COMP_OUTPUT_PID1) || ((x) == PID_COMP_OUTPUT_PID2) || ((x) == PID_COMP_OUTPUT_MAX) \
  || ((x) == PID_COMP_OUTPUT_MIN))

/* Parameter valid check for PID burst function */
#define IS_PID_BURST_FUNC(x)                                                                      \
    (((x) == PID_BURST_FUNC_NONE) || ((x) == PID_BURST_FUNC_PID1) || ((x) == PID_BURST_FUNC_PID2) \
  || ((x) == PID_BURST_FUNC_COMP_OUTPUT))

/* Parameter valid check for PID burst mode */
#define IS_PID_BURST_MD(x) (((x) == PID_BURST_MD_1) || ((x) == PID_BURST_MD_2))

/* Parameter valid check for PID burst interrupt selection */
#define IS_PID_BURST_INT_SEL(x) (((x) == PID_BURST_INT_DONE) || ((x) == PID_BURST_INT_DONE_THRESHOLD))

#define IS_PID_CMP_UNIT(x) ((x) == CM_PID_CMP)

#define IS_PID_COMP_FLAG(x) (((x) != 0UL) && (((x) | PID_COMP_FLAG_ALL) == PID_COMP_FLAG_ALL))

