MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_pid.c
#define IS_PID_COMP_CLR_FLAG(x) (((x) != 0UL) && (((x) | PID_COMP_FLAG_CLR_ALL) == PID_COMP_FLAG_CLR_ALL))

#define IS_PID_FUNCTIONAL_STATE(x) (((x) == (uint32_t)DISABLE) || ((x) == (uint32_t)ENABLE))
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup PID_Global_Functions PID Global Functions
 * @{
 */
/**
 * @brief Enable or disable the PID calculate
 * @param [in] PIDx                    PID unit
 * @param [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void PID_Cmd(CM_PID_TypeDef *PIDx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_PID_UNIT(PIDx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState)
    {
        SET_REG32_BIT(PIDx->CR, PID_CR_PID_EN);
    }
    else
    {
        CLR_REG32_BIT(PIDx->CR, PID_CR_PID_EN);
    }
}

/**
 * @brief Start PID calculate
 * @param [in] PIDx                    PID unit
 * @retval None
 * @note Please set PID_EN to 1 before called PID_Start().
 */
void PID_Start(CM_PID_TypeDef *PIDx)
{
    DDL_ASSERT(IS_PID_UNIT(PIDx));

    SET_REG32_BIT(PIDx->CR, PID_CR_START);
}

/**
 * @brief Clear PID data(all)
 * @param [in] PIDx                    PID unit
 * @retval None
 */
void PID_ClearData(CM_PID_TypeDef *PIDx)
{
    DDL_ASSERT(IS_PID_UNIT(PIDx));

    SET_REG32_BIT(PIDx->CR, PID_CR_CLEAR);
}

/**
 * @brief Reset PID FSM
 * @param [in] PIDx                    PID unit
 * @retval None
 */
void PID_ResetFsm(CM_PID_TypeDef *PIDx)
{
    DDL_ASSERT(IS_PID_UNIT(PIDx));

    SET_REG32_BIT(PIDx->CR, PID_CR_FSM_RST);
}

/**
 * @brief Enable or disable the PID interrupt
 * @param [in] PIDx                    PID unit
 * @param [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void PID_IntCmd(CM_PID_TypeDef *PIDx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_PID_UNIT(PIDx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState)
    {
        SET_REG32_BIT(PIDx->CR2, PID_CR2_INT_EN);
    }
    else
    {
        CLR_REG32_BIT(PIDx->CR2, PID_CR2_INT_EN);
    }
}

/**
 * @brief Enable or disable software start calculate
 * @param [in] PIDx                    PID unit
 * @param [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void PID_SWStartCmd(CM_PID_TypeDef *PIDx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_PID_UNIT(PIDx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState)
    {
        SET_REG32_BIT(PIDx->CR2, PID_CR2_RAMP_EN);
    }
    else
    {
        CLR_REG32_BIT(PIDx->CR2, PID_CR2_RAMP_EN);
    }
}

/**
 * @brief Init PID  initial structure with default value.
 * @param [in] pstcPidInit             Specifies the parameter of PID initial structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t PID_StructInit(stc_pid_init_t *pstcPidInit)
{
    int32_t i32Ret = LL_OK;

    /* Check if pointer is NULL */

    if (NULL == pstcPidInit)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcPidInit->u32PidEn        = (uint32_t)DISABLE;
        pstcPidInit->u32CalMode      = PID_CAL_MD_SW;
        pstcPidInit->u32IMode        = PID_INTEG_MD_EK;
        pstcPidInit->u32DMode        = PID_DIFF_MD_WITHOUT_FEEDBACK;
        pstcPidInit->u32CoefMode     = PID_COEF_MD_1;
        pstcPidInit->u32AntiWindupEn = (uint32_t)DISABLE;
        pstcPidInit->u32U1P1En       = (uint32_t)DISABLE;
        pstcPidInit->u32U1P2En       = (uint32_t)DISABLE;
        pstcPidInit->u32U3P1En       = (uint32_t)DISABLE;
        pstcPidInit->u32U3P2En       = (uint32_t)DISABLE;
        pstcPidInit->u32U3P3En       = (uint32_t)DISABLE;
        pstcPidInit->u32U3P4En       = (uint32_t)DISABLE;
        pstcPidInit->u32U4P1En       = (uint32_t)DISABLE;
        pstcPidInit->u32U5P1En       = (uint32_t)DISABLE;
        pstcPidInit->u32U5P2En       = (uint32_t)DISABLE;
    }

    return i32Ret;
}

/**
 * @brief PID initialize
 * @param [in] PIDx                    PID unit
 * @param [in] pstcPidInit             Specifies the PID initial config.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t PID_Init(CM_PID_TypeDef *PIDx, stc_pid_init_t *pstcPidInit)
{
    int32_t i32Ret = LL_OK;
    uint32_t u32Value;

    /* Check if pointer is NULL */

    if (NULL == pstcPidInit)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        DDL_ASSERT(IS_PID_UNIT(PIDx));
        DDL_ASSERT(IS_PID_FUNCTIONAL_STATE(pstcPidInit->u32PidEn));
        DDL_ASSERT(IS_PID_CAL_MD(pstcPidInit->u32CalMode));
        DDL_ASSERT(IS_PID_INTEG_MD(pstcPidInit->u32IMode));
        DDL_ASSERT(IS_PID_DIFF_MD(pstcPidInit->u32DMode));
        DDL_ASSERT(IS_PID_COEF_MD(pstcPidInit->u32CoefMode));
        DDL_ASSERT(IS_PID_FUNCTIONAL_STATE(pstcPidInit->u32AntiWindupEn));
        DDL_ASSERT(IS_PID_FUNCTIONAL_STATE(pstcPidInit->u32U1P1En));
        DDL_ASSERT(IS_PID_FUNCTIONAL_STATE(pstcPidInit->u32U1P2En));
        DDL_ASSERT(IS_PID_FUNCTIONAL_STATE(pstcPidInit->u32U3P1En));
        DDL_ASSERT(IS_PID_FUNCTIONAL_STATE(pstcPidInit->u32U3P2En));
        DDL_ASSERT(IS_PID_FUNCTIONAL_STATE(pstcPidInit->u32U3P3En));
        DDL_ASSERT(IS_PID_FUNCTIONAL_STATE(pstcPidInit->u32U3P4En));
        DDL_ASSERT(IS_PID_FUNCTIONAL_STATE(pstcPidInit->u32U4P1En));
        DDL_ASSERT(IS_PID_FUNCTIONAL_STATE(pstcPidInit->u32U5P1En));
        DDL_ASSERT(IS_PID_FUNCTIONAL_STATE(pstcPidInit->u32U5P2En));

        u32Value = ((uint32_t)pstcPidInit->u32PidEn << PID_CR_PID_EN_POS)
                 | ((uint32_t)pstcPidInit->u32U1P1En << PID_CR_U1P1_EN_POS)
                 | ((uint32_t)pstcPidInit->u32U1P2En << PID_CR_U1P2_EN_POS)
                 | ((uint32_t)pstcPidInit->u32U3P1En << PID_CR_U3P1_EN_POS)
                 | ((uint32_t)pstcPidInit->u32U3P2En << PID_CR_U3P2_EN_POS)
                 | ((uint32_t)pstcPidInit->u32U3P3En << PID_CR_U3P3_EN_POS)
                 | ((uint32_t)pstcPidInit->u32U3P4En << PID_CR_U3P4_EN_POS)
                 | ((uint32_t)pstcPidInit->u32U4P1En << PID_CR_U4P1_EN_POS)
                 | ((uint32_t)pstcPidInit->u32U5P1En << PID_CR_U5P1_EN_POS)
                 | ((uint32_t)pstcPidInit->u32U5P2En << PID_CR_U5P2_EN_POS)
                 | ((uint32_t)pstcPidInit->u32AntiWindupEn << PID_CR_ISAT_EN_POS) | pstcPidInit->u32CoefMode
                 | pstcPidInit->u32DMode | pstcPidInit->u32IMode | pstcPidInit->u32CalMode;

