MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_pid.c
        if ((uint32_t)ENABLE == pstcPidInit->u32U1P2En)
        {
            DDL_ASSERT(IS_PID_U1_P2_DATA_SEL(pstcPidInit->u32U1P2Sel));
            u32Value |= pstcPidInit->u32U1P2Sel;
        }

        if ((uint32_t)ENABLE == pstcPidInit->u32U3P2En)
        {
            DDL_ASSERT(IS_PID_U3_P2_DATA_SEL(pstcPidInit->u32U3P2Sel));
            DDL_ASSERT(IS_PID_U3_P2_WAIT_STATE(pstcPidInit->u32U3P2Wait));
            u32Value |= (pstcPidInit->u32U3P2Sel | pstcPidInit->u32U3P2Wait);
        }

        if ((uint32_t)ENABLE == pstcPidInit->u32U3P4En)
        {
            DDL_ASSERT(IS_PID_U3_P4_CAL_TYPE(pstcPidInit->u32U3P4Type));
            DDL_ASSERT(IS_PID_U3_P4_WAIT_STATE(pstcPidInit->u32U3P4Wait));
            u32Value |= (pstcPidInit->u32U3P4Type | pstcPidInit->u32U3P4Wait);
        }

        WRITE_REG32(PIDx->CR, u32Value);
    }

    return i32Ret;
}

/**
 * @brief Init PID software start initial structure with default value.
 * @param [in] pstcSWInit              Specifies the parameter of PID software start initial structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t PID_SWStructInit(stc_pid_sw_init_t *pstcSWInit)
{
    int32_t i32Ret = LL_OK;

    /* Check if pointer is NULL */

    if (NULL == pstcSWInit)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcSWInit->u32State     = (uint32_t)DISABLE;
        pstcSWInit->u32InitEvSel = PID_SW_INIT_EV_REF;
        pstcSWInit->f32FinalEv   = 0.0f;
        pstcSWInit->f32Step      = 0.0f;
    }

    return i32Ret;
}

/**
 * @brief PID initialize
 * @param [in] PIDx                    PID unit
 * @param [in] pstcSWInit              Specifies the PID initial config.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t PID_SWInit(CM_PID_TypeDef *PIDx, stc_pid_sw_init_t *pstcSWInit)
{
    int32_t i32Ret = LL_OK;

    /* Check if pointer is NULL */

    if (NULL == pstcSWInit)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        DDL_ASSERT(IS_PID_UNIT(PIDx));
        DDL_ASSERT(IS_PID_FUNCTIONAL_STATE(pstcSWInit->u32State));
        DDL_ASSERT(IS_PID_SW_INIT_EV_SEL(pstcSWInit->u32InitEvSel));

        PID_FLOAT_WRITE_REG32(PIDx->REF_FIN, pstcSWInit->f32FinalEv);
        PID_FLOAT_WRITE_REG32(PIDx->REF_STEP, pstcSWInit->f32Step);
        MODIFY_REG32(PIDx->CR2,
                     PID_CR2_RAMP_EN | PID_CR2_REF_INIT,
                     (pstcSWInit->u32InitEvSel | ((uint32_t)pstcSWInit->u32State << PID_CR2_RAMP_EN_POS)));
    }

    return i32Ret;
}

/**
 * @brief Init PID configure structure with default value.
 * @param [in] pstcConfig              Specifies the parameter of PID configure structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t PID_ConfigStructInit(stc_pid_config_t *pstcConfig)
{
    int32_t i32Ret = LL_OK;

    /* Check if pointer is NULL */

    if (NULL == pstcConfig)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcConfig->u32AValSel  = PID_AVAL_REG;
        pstcConfig->u32EValSel  = PID_EV_REG;
        pstcConfig->u32EkMinSel = PID_EK_MIN_EMIN;
        pstcConfig->u32KfMinSel = PID_KF_MIN_KFMIN;
        pstcConfig->u32KiMinSel = PID_KI_MIN_IMIN;
        pstcConfig->u32KdMinSel = PID_KD_MIN_DMIN;
        pstcConfig->u32UMinSel  = PID_U_MIN_UMIN;
        pstcConfig->u32U1MinSel = PID_U1_MIN_U1MIN;
        pstcConfig->u32U3MinSel = PID_U3_MIN_U3MIN;
        pstcConfig->u32U5MinSel = PID_U5_MIN_U5MIN;
    }

    return i32Ret;
}

/**
 * @brief Config PID
 * @param [in] PIDx                    PID unit
 * @param [in] pstcConfig              Specifies the PID config
 * @retval int32_t:
 *         - LL_OK: config success
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t PID_Config(CM_PID_TypeDef *PIDx, stc_pid_config_t *pstcConfig)
{
    int32_t i32Ret = LL_OK;
    uint32_t u32Mask;
    uint32_t u32Value;

    /* Check if pointer is NULL */

    if (NULL == pstcConfig)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        DDL_ASSERT(IS_PID_UNIT(PIDx));
        DDL_ASSERT(IS_PID_AVAL_SEL(pstcConfig->u32AValSel));
        DDL_ASSERT(IS_PID_EV_SEL(pstcConfig->u32EValSel));
        DDL_ASSERT(IS_PID_EK_MIN_SEL(pstcConfig->u32EkMinSel));
        DDL_ASSERT(IS_PID_KF_MIN_SEL(pstcConfig->u32KfMinSel));
        DDL_ASSERT(IS_PID_KI_MIN_SEL(pstcConfig->u32KiMinSel));
        DDL_ASSERT(IS_PID_KD_MIN_SEL(pstcConfig->u32KdMinSel));
        DDL_ASSERT(IS_PID_U_MIN_SEL(pstcConfig->u32UMinSel));
        DDL_ASSERT(IS_PID_U1_MIN_SEL(pstcConfig->u32U1MinSel));
        DDL_ASSERT(IS_PID_U3_MIN_SEL(pstcConfig->u32U3MinSel));
        DDL_ASSERT(IS_PID_U5_MIN_SEL(pstcConfig->u32U5MinSel));

        u32Mask = PID_CR2_EMIN_SEL | PID_CR2_IMIN_SEL | PID_CR2_DMIN_SEL | PID_CR2_UMIN_SEL | PID_CR2_U1MIN_SEL
                | PID_CR2_U3MIN_SEL | PID_CR2_U5MIN_SEL | PID_CR2_KFMIN_SEL | PID_CR2_DSEL | PID_CR2_ASEL;
        u32Value = pstcConfig->u32AValSel | pstcConfig->u32EValSel | pstcConfig->u32EkMinSel | pstcConfig->u32KfMinSel
                 | pstcConfig->u32KiMinSel | pstcConfig->u32KdMinSel | pstcConfig->u32UMinSel | pstcConfig->u32U1MinSel
                 | pstcConfig->u32U3MinSel | pstcConfig->u32U5MinSel;

        MODIFY_REG32(PIDx->CR2, u32Mask, u32Value);
    }

    return i32Ret;
}

/**
 * @brief Init PID gain config structure with default value.
 * @param [in] pstcGainConfig          Specifies the parameter of PID gain config structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t PID_GainStructInit(stc_pid_gain_config_t *pstcGainConfig)
{
    int32_t i32Ret = LL_OK;

    /* Check if pointer is NULL */

    if (NULL == pstcGainConfig)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcGainConfig->f32Kp  = 0.0f;
        pstcGainConfig->f32Ki  = 0.0f;
        pstcGainConfig->f32Kd  = 0.0f;
        pstcGainConfig->f32Kdf = 0.0f;
    }

    return i32Ret;
}

/**
 * @brief Config PID gain
 * @param [in] PIDx                    PID unit
 * @param [in] u8CoefNum               Specifies the PID coefficient number @ref PID_Coef_Num_Sel
 * @param [in] pstcGainConfig          Specifies the PID gain config
 * @retval int32_t:
 *         - LL_OK: config success
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t PID_GainConfig(CM_PID_TypeDef *PIDx, uint8_t u8CoefNum, stc_pid_gain_config_t *pstcGainConfig)
{
    int32_t i32Ret = LL_OK;

