MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_pid.c
    /* Check if pointer is NULL */

    if (NULL == pstcGainConfig)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        DDL_ASSERT(IS_PID_UNIT(PIDx));
        DDL_ASSERT(IS_PID_COEF_NUM(u8CoefNum));

        PID_FLOAT_WRITE_REG32(*PID_COEF_REG(PIDx->KP1, u8CoefNum), pstcGainConfig->f32Kp);
        PID_FLOAT_WRITE_REG32(*PID_COEF_REG(PIDx->KI1, u8CoefNum), pstcGainConfig->f32Ki);
        PID_FLOAT_WRITE_REG32(*PID_COEF_REG(PIDx->KD1, u8CoefNum), pstcGainConfig->f32Kd);

        switch (u8CoefNum)
        {
        case PID_COEF_NUM_1:
            PID_FLOAT_WRITE_REG32(PIDx->KDF1, pstcGainConfig->f32Kdf);
            break;
        case PID_COEF_NUM_2:
            PID_FLOAT_WRITE_REG32(PIDx->KDF2, pstcGainConfig->f32Kdf);
            break;
        case PID_COEF_NUM_3:
            PID_FLOAT_WRITE_REG32(PIDx->KDF3, pstcGainConfig->f32Kdf);
            break;
        default:
            PID_FLOAT_WRITE_REG32(PIDx->KDF1, pstcGainConfig->f32Kdf);
            break;
        }
    }

    return i32Ret;
}

/**
 * @brief Read PID actual gain
 * @param [in] PIDx                    PID unit
 * @param [in] pstcGain                Specifies the PID actual gain
 * @retval int32_t:
 *         - LL_OK: Read success
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t PID_ReadActualGain(CM_PID_TypeDef *PIDx, stc_pid_gain_t *pstcGain)
{
    int32_t i32Ret = LL_OK;

    /* Check if pointer is NULL */

    if (NULL == pstcGain)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcGain->f32Kf  = PID_FLOAT_READ_REG32(PIDx->KF_ACT);
        pstcGain->f32Kp  = PID_FLOAT_READ_REG32(PIDx->KP_ACT);
        pstcGain->f32Ki  = PID_FLOAT_READ_REG32(PIDx->KI_ACT);
        pstcGain->f32Kd  = PID_FLOAT_READ_REG32(PIDx->KD_ACT);
        pstcGain->f32Kdf = PID_FLOAT_READ_REG32(PIDx->KDF_ACT);
    }

    return i32Ret;
}

/**
 * @brief Init PID gain switch structure with default value.
 * @param [in] pstcGainSwitch          Specifies the parameter of PID gain switch structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t PID_GainSwitchStructInit(stc_pid_gain_switch_t *pstcGainSwitch)
{
    int32_t i32Ret = LL_OK;

    /* Check if pointer is NULL */

    if (NULL == pstcGainSwitch)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcGainSwitch->f32threshold1 = 0.0f;
        pstcGainSwitch->f32threshold2 = 0.0f;
        pstcGainSwitch->f32Delay1     = 0.0f;
        pstcGainSwitch->f32Delay2     = 0.0f;
    }

    return i32Ret;
}

/**
 * @brief Config PID gain switch
 * @param [in] PIDx                    PID unit
 * @param [in] pstcGainSwitch          Specifies the PID gain switch config value
 * @retval int32_t:
 *         - LL_OK: config success
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t PID_GainSwitchConfig(CM_PID_TypeDef *PIDx, stc_pid_gain_switch_t *pstcGainSwitch)
{
    int32_t i32Ret = LL_OK;

    /* Check if pointer is NULL */

    if (NULL == pstcGainSwitch)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        DDL_ASSERT(IS_PID_UNIT(PIDx));

        PID_FLOAT_WRITE_REG32(PIDx->CSTH1, pstcGainSwitch->f32threshold1);
        PID_FLOAT_WRITE_REG32(PIDx->CSTH2, pstcGainSwitch->f32threshold2);
        PID_FLOAT_WRITE_REG32(PIDx->DLY1, pstcGainSwitch->f32Delay1);
        PID_FLOAT_WRITE_REG32(PIDx->DLY2, pstcGainSwitch->f32Delay2);
    }

    return i32Ret;
}

/**
 * @brief Init PID value config structure with default value.
 * @param [in] pstValueConfig          Specifies the parameter of PID value config structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t PID_ValueStructInit(stc_pid_value_config_t *pstValueConfig)
{
    int32_t i32Ret = LL_OK;

    /* Check if pointer is NULL */

    if (NULL == pstValueConfig)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstValueConfig->f32EkMax = 0.0f;
        pstValueConfig->f32EkMin = 0.0f;
        pstValueConfig->f32KiMax = 0.0f;
        pstValueConfig->f32KiMin = 0.0f;
        pstValueConfig->f32KdMax = 0.0f;
        pstValueConfig->f32KdMin = 0.0f;
        pstValueConfig->f32UMax  = 0.0f;
        pstValueConfig->f32UMin  = 0.0f;
        pstValueConfig->f32U1Max = 0.0f;
        pstValueConfig->f32U3Max = 0.0f;
        pstValueConfig->f32U3Min = 0.0f;
        pstValueConfig->f32U5Max = 0.0f;
        pstValueConfig->f32U5Min = 0.0f;
    }

    return i32Ret;
}

/**
 * @brief Config PID max & min value
 * @param [in] PIDx                    PID unit
 * @param [in] pstValueConfig          Specifies the PID max & min value config
 * @retval int32_t:
 *         - LL_OK: config success
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t PID_ValueConfig(CM_PID_TypeDef *PIDx, stc_pid_value_config_t *pstValueConfig)
{
    int32_t i32Ret = LL_OK;

    /* Check if pointer is NULL */

    if (NULL == pstValueConfig)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        DDL_ASSERT(IS_PID_UNIT(PIDx));
        PID_FLOAT_WRITE_REG32(PIDx->EMAX, pstValueConfig->f32EkMax);
        PID_FLOAT_WRITE_REG32(PIDx->EMIN, pstValueConfig->f32EkMin);
        PID_FLOAT_WRITE_REG32(PIDx->IMAX, pstValueConfig->f32KiMax);
        PID_FLOAT_WRITE_REG32(PIDx->IMIN, pstValueConfig->f32KiMin);
        PID_FLOAT_WRITE_REG32(PIDx->DMAX, pstValueConfig->f32KdMax);
        PID_FLOAT_WRITE_REG32(PIDx->DMIN, pstValueConfig->f32KdMin);
        PID_FLOAT_WRITE_REG32(PIDx->UMAX, pstValueConfig->f32UMax);
        PID_FLOAT_WRITE_REG32(PIDx->UMIN, pstValueConfig->f32UMin);
        PID_FLOAT_WRITE_REG32(PIDx->U1MAX, pstValueConfig->f32U1Max);
        PID_FLOAT_WRITE_REG32(PIDx->U1MIN, pstValueConfig->f32U1Min);
        PID_FLOAT_WRITE_REG32(PIDx->U3MAX, pstValueConfig->f32U3Max);
        PID_FLOAT_WRITE_REG32(PIDx->U3MIN, pstValueConfig->f32U3Min);
        PID_FLOAT_WRITE_REG32(PIDx->U5MAX, pstValueConfig->f32U5Max);
        PID_FLOAT_WRITE_REG32(PIDx->U5MIN, pstValueConfig->f32U5Min);
    }

    return i32Ret;
}

/**
 * @brief Set PID expected value.
 * @param [in] PIDx                    PID unit
 * @param [in] f32Ev                    Expected value
 * @retval None
 */
void PID_SetExpectedValue(CM_PID_TypeDef *PIDx, float32_t f32Ev)
{
    DDL_ASSERT(IS_PID_UNIT(PIDx));

    PID_FLOAT_WRITE_REG32(PIDx->REF, f32Ev);
}

/**
 * @brief Set PID actual value.
 * @param [in] PIDx                    PID unit
 * @param [in] f32Av                    Actual value
 * @retval None
 */
void PID_SetActualValue(CM_PID_TypeDef *PIDx, float32_t f32Av)
{
    DDL_ASSERT(IS_PID_UNIT(PIDx));

    PID_FLOAT_WRITE_REG32(PIDx->AVAL, f32Av);
}

/**
 * @brief Read PID control output value.
 * @param [in] PIDx                    PID unit
 * @retval float32_t: PID control output value
 */
float32_t PID_GetUValue(CM_PID_TypeDef *PIDx)
{
    float32_t f32U;

