MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_pid.c
    DDL_ASSERT(IS_PID_UNIT(PIDx));

    f32U = PID_FLOAT_READ_REG32(PIDx->U);

    return f32U;
}

/**
 * @brief Read PID final value.
 * @param [in] PIDx                    PID unit
 * @retval float32_t: PID final value
 */
float32_t PID_GetFinalValue(CM_PID_TypeDef *PIDx)
{
    float32_t f32Final;

    DDL_ASSERT(IS_PID_UNIT(PIDx));

    f32Final = PID_FLOAT_READ_REG32(PIDx->U4);

    return f32Final;
}

/**
 * @brief Read PID U5 value.
 * @param [in] PIDx                    PID unit
 * @retval float32_t: PID U5 value
 */
float32_t PID_GetU5Value(CM_PID_TypeDef *PIDx)
{
    float32_t f32U5;

    DDL_ASSERT(IS_PID_UNIT(PIDx));

    f32U5 = PID_FLOAT_READ_REG32(PIDx->U5);

    return f32U5;
}
/**
 * @brief Init PID UxPx structure with default value.
 * @param [in] pstcUxPx                Specifies the parameter of PID UxPx structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t PID_UxPxStructInit(stc_pid_uxpx_t *pstcUxPx)
{
    int32_t i32Ret = LL_OK;

    /* Check if pointer is NULL */

    if (NULL == pstcUxPx)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcUxPx->f32U1P1 = 0.0f;
        pstcUxPx->f32U3P1 = 0.0f;
        pstcUxPx->f32U3P3 = 0.0f;
        pstcUxPx->f32U4P1 = 0.0f;
        pstcUxPx->f32U5P1 = 0.0f;
        pstcUxPx->f32U5P2 = 0.0f;
    }

    return i32Ret;
}

/**
 * @brief Config PID UxPx value if need
 * @param [in] PIDx                    PID unit
 * @param [in] pstcUxPx                Specifies the PID UxPx value
 * @retval int32_t:
 *         - LL_OK: config success
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t PID_UxPxConfig(CM_PID_TypeDef *PIDx, stc_pid_uxpx_t *pstcUxPx)
{
    int32_t i32Ret = LL_OK;

    /* Check if pointer is NULL */

    if (NULL == pstcUxPx)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        DDL_ASSERT(IS_PID_UNIT(PIDx));

        PID_FLOAT_WRITE_REG32(PIDx->U1P1, pstcUxPx->f32U1P1);
        PID_FLOAT_WRITE_REG32(PIDx->U3P1, pstcUxPx->f32U3P1);
        PID_FLOAT_WRITE_REG32(PIDx->U3P3, pstcUxPx->f32U3P3);
        PID_FLOAT_WRITE_REG32(PIDx->U4P1, pstcUxPx->f32U4P1);
        PID_FLOAT_WRITE_REG32(PIDx->U5P1, pstcUxPx->f32U5P1);
        PID_FLOAT_WRITE_REG32(PIDx->U5P2, pstcUxPx->f32U5P2);
    }

    return i32Ret;
}

/**
 * @brief Read PID UxPx value.
 * @param [in] PIDx                    PID unit
 * @param [in] pstcUxPx                Specifies the parameter of PID UxPx structure.
 * @retval int32_t:
 *         - LL_OK: Read success
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t PID_ReadUxPx(CM_PID_TypeDef *PIDx, stc_pid_uxpx_t *pstcUxPx)
{
    int32_t i32Ret = LL_OK;

    /* Check if pointer is NULL */

    if (NULL == pstcUxPx)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        DDL_ASSERT(IS_PID_UNIT(PIDx));

        pstcUxPx->f32U1P1 = PID_FLOAT_READ_REG32(PIDx->U1P1);
        pstcUxPx->f32U1P2 = PID_FLOAT_READ_REG32(PIDx->U1P2);
        pstcUxPx->f32U3P1 = PID_FLOAT_READ_REG32(PIDx->U3P1);
        pstcUxPx->f32U3P2 = PID_FLOAT_READ_REG32(PIDx->U3P2);
        pstcUxPx->f32U3P3 = PID_FLOAT_READ_REG32(PIDx->U3P3);
        pstcUxPx->f32U3P4 = PID_FLOAT_READ_REG32(PIDx->U3P4);
        pstcUxPx->f32U4P1 = PID_FLOAT_READ_REG32(PIDx->U4P1);
        pstcUxPx->f32U5P1 = PID_FLOAT_READ_REG32(PIDx->U5P1);
        pstcUxPx->f32U5P2 = PID_FLOAT_READ_REG32(PIDx->U5P2);
    }

    return i32Ret;
}

/**
 * @brief Read PID value while calculating
 * @param [in] PIDx                    PID unit
 * @param [in] pstcValue               Specifies the PID value
 * @retval int32_t:
 *         - LL_OK: Read success
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t PID_ReadValue(CM_PID_TypeDef *PIDx, stc_pid_value_t *pstcValue)
{
    int32_t i32Ret = LL_OK;

    /* Check if pointer is NULL */

    if (NULL == pstcValue)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        DDL_ASSERT(IS_PID_UNIT(PIDx));

        pstcValue->f32Ek   = PID_FLOAT_READ_REG32(PIDx->ERR);
        pstcValue->f32PVal = PID_FLOAT_READ_REG32(PIDx->PVAL);
        pstcValue->f32IVal = PID_FLOAT_READ_REG32(PIDx->IVAL);
        pstcValue->f32DVal = PID_FLOAT_READ_REG32(PIDx->DVAL);
        pstcValue->f32U    = PID_FLOAT_READ_REG32(PIDx->U);
        pstcValue->f32U1   = PID_FLOAT_READ_REG32(PIDx->U1);
        pstcValue->f32U2   = PID_FLOAT_READ_REG32(PIDx->U2);
        pstcValue->f32U3   = PID_FLOAT_READ_REG32(PIDx->U3);
        pstcValue->f32U4   = PID_FLOAT_READ_REG32(PIDx->U4);
        pstcValue->f32U5   = PID_FLOAT_READ_REG32(PIDx->U5);
        pstcValue->u32Uf   = READ_REG32(PIDx->UF);
        pstcValue->u32U5f  = READ_REG32(PIDx->U5F);
    }

    return i32Ret;
}

/**
 * @brief Get PID status.
 * @param [in] PIDx                    PID unit
 * @param [in] u32Flag                 Specifies the flag to be read. @ref PID_Flag_Sel
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t PID_GetStatus(CM_PID_TypeDef *PIDx, uint32_t u32Flag)
{
    DDL_ASSERT(IS_PID_UNIT(PIDx));
    DDL_ASSERT(IS_PID_FLAG(u32Flag));

    return ((0x00U != READ_REG32_BIT(PIDx->STA, u32Flag)) ? SET : RESET);
}

/**
 * @brief Clear PID status.
 * @param [in] PIDx                    PID unit
 * @param [in] u32Flag                 Specifies the flag to be read. @ref PID_Flag_Sel
 * @retval None.
 */
void PID_ClearStatus(CM_PID_TypeDef *PIDx, uint32_t u32Flag)
{
    DDL_ASSERT(IS_PID_UNIT(PIDx));
    DDL_ASSERT(IS_PID_FLAG(u32Flag));

    WRITE_REG32(PIDx->STA, u32Flag);
}

/**
 * @brief Init PID compete initial structure with default value.
 * @param [in] pstcCmpInit             Specifies the parameter of PID compete initial structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t PID_CMP_StructInit(stc_pid_cmp_init_t *pstcCmpInit)
{
    int32_t i32Ret = LL_OK;

    /* Check if pointer is NULL */

    if (NULL == pstcCmpInit)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        pstcCmpInit->u32CompEn        = (uint32_t)DISABLE;
        pstcCmpInit->u32CompIntEn     = (uint32_t)DISABLE;
        pstcCmpInit->u32CompOutputSel = PID_COMP_OUTPUT_PID1;
        pstcCmpInit->u32BurstIntEn    = (uint32_t)DISABLE;
        pstcCmpInit->u32BurstFuncSel  = PID_BURST_FUNC_NONE;
        pstcCmpInit->u32BurstMode     = PID_BURST_MD_1;
        pstcCmpInit->u32BurstIntSel   = PID_BURST_INT_DONE_THRESHOLD;
    }

    return i32Ret;
}

/**
 * @brief Init PID compete.
 * @param [in] PID_CMP                 PID compete unit
 * @param [in] pstcCmpInit             Specifies the parameter of PID compete initial structure.
 * @retval int32_t:
 *         - LL_OK: Initialize success
 *         - LL_ERR_INVD_PARAM: NULL pointer
 */
int32_t PID_CMP_Init(CM_PID_CMP_TypeDef *PID_CMP, stc_pid_cmp_init_t *pstcCmpInit)
{
    int32_t i32Ret = LL_OK;
    uint32_t u32Value;

