MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_pid.c
    /* Check if pointer is NULL */

    if (NULL == pstcCmpInit)
    {
        i32Ret = LL_ERR_INVD_PARAM;
    }
    else
    {
        DDL_ASSERT(IS_PID_FUNCTIONAL_STATE(pstcCmpInit->u32CompEn));
        DDL_ASSERT(IS_PID_FUNCTIONAL_STATE(pstcCmpInit->u32CompIntEn));
        DDL_ASSERT(IS_PID_COMP_OUTPUT_SEL(pstcCmpInit->u32CompOutputSel));
        DDL_ASSERT(IS_PID_FUNCTIONAL_STATE(pstcCmpInit->u32BurstIntEn));
        DDL_ASSERT(IS_PID_BURST_FUNC(pstcCmpInit->u32BurstFuncSel));
        DDL_ASSERT(IS_PID_BURST_MD(pstcCmpInit->u32BurstMode));
        DDL_ASSERT(IS_PID_BURST_INT_SEL(pstcCmpInit->u32BurstIntSel));

        u32Value = (uint32_t)pstcCmpInit->u32CompEn | pstcCmpInit->u32CompOutputSel
                 | ((uint32_t)pstcCmpInit->u32CompIntEn << PID_CMP_CR_CMP_INT_EN_POS) | pstcCmpInit->u32BurstFuncSel
                 | pstcCmpInit->u32BurstMode | pstcCmpInit->u32BurstIntSel
                 | ((uint32_t)pstcCmpInit->u32BurstIntEn << PID_CMP_CR_BURST_INT_EN_POS);

        WRITE_REG32(PID_CMP->CR, u32Value);
    }

    return i32Ret;
}

/**
 * @brief Get PID compete status.
 * @param [in] PID_CMPx                PID compete unit
 * @param [in] u32Flag                 Specifies the flag to be read. @ref PID_Comp_Flag
 * @return Flag status of the specified flag.
 */
uint32_t PID_CMP_GetStatus(CM_PID_CMP_TypeDef *PID_CMPx, uint32_t u32Flag)
{
    DDL_ASSERT(IS_PID_CMP_UNIT(PID_CMPx));
    DDL_ASSERT(IS_PID_COMP_FLAG(u32Flag));

    return READ_REG32_BIT(PID_CMPx->CSTA, u32Flag);
}

/**
 * @brief Clear PID compete status.
 * @param [in] PID_CMPx                PID compete unit
 * @param [in] u32Flag                 Specifies the flag to be cleared. @ref PID_Comp_Flag
 * @retval None.
 */
void PID_CMP_ClearStatus(CM_PID_CMP_TypeDef *PID_CMPx, uint32_t u32Flag)
{
    DDL_ASSERT(IS_PID_CMP_UNIT(PID_CMPx));
    DDL_ASSERT(IS_PID_COMP_CLR_FLAG(u32Flag));

    WRITE_REG32(PID_CMPx->CSTA, u32Flag);
}

/**
 * @}
 */

#endif /* LL_PID_ENABLE */

/**
 * @}
 */

/**
 * @}
 */
/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
